

class LabRule:
    def __init__(self):
        self.rule = [

        ]

        '急性阑尾炎': [
            ('全血', '中性粒细胞%', 'gt', 75),
            ('全血', '白细胞', 'gt', 9.5),
            ('全血', 'C反应蛋白', 'gt', 10),
            ('全血', '降钙素原', 'gt', 0.1),
            ('血清', '降钙素原', 'gt', 0.1)
        ],
        '急性胰腺炎': [
            ('血清', '脂肪酶', 'gt', 900),
            ('血清', '淀粉酶', 'gt', 405)
        ],
        '异位妊娠': [
            ('血清', 'β-绒毛膜促性腺激素', 'gt', 10)
        ],
        '急性胆管炎': [
            ('全血', '白细胞', 'lt', 4),
            ('全血', '白细胞', 'gt', 10),
            ('全血', 'C反应蛋白', 'gt', 10),
            ('血清', '总胆红素', 'gt', 22),
            ('血清', '天冬氨酸氨基转移酶', 'gt', 75),
            ('血清', '丙氨酸氨基转移酶', 'gt', 60),
            ('血清', '碱性磷酸酶', 'gt', 187.5),
            ('血清', 'γ-谷氨酰转移酶', 'gt', 90)
        ],
        '急性胆囊炎': [
            ('全血', '白细胞', 'gt', 9.5),
            ('全血', 'C反应蛋白', 'gt', 10),
            ('全血', '血沉', 'gt', 26)
        ],
        '上尿路结石': [
            ('尿液', '红细胞', 'gt', 28)
        ],
        '急性肾盂肾炎': [
            ('尿液', '白细胞', 'gt', 17)
        ]
